
//收入增幅 一般公共预算收入 税占比  点击事件
//收入增幅
$("#ctrl_622120-194039324").click(function(){

    //收入增幅升高
    $("#ctrl_623120-18548734").css("top","17.53%");//收入增幅
    $("#ctrl_623120-175614457").css("top","28.58%");//百分比
    $("#ctrl_623120-18826887").css("top","33.32%");//箭头
    // $("#ctrl_78120-1861553").css("top", "31.05%");//亿

    //一般公共预算降低
    $("#ctrl_623120-18313424").css("top","33.68%");//百分比
    $("#ctrl_623120-18731143").css("top","20.53%");//一般

    //税占比降低
    $("#ctrl_623120-175949120").css("top","31.05%");//百分比
    $("#ctrl_623120-18731345").css("top","21.05%");//税占比



    $("#ctrl_622120-194037116").css("top","32%");
    $("#ctrl_622120-194111917").css("top","32%");
    $("#ctrl_622120-194039324").css("top","29%");
    $("#ctrl_625120-16501815").css("display","block");
    $("#ctrl_625120-16501359").css("display","none");
    $("#ctrl_622120-19457942").css("display","none");

    //全省
    $("#ctrl_625120-162817983").find("iframe")[0].contentWindow.changeData("收入增幅");
});


//一般公共预算收入
$("#ctrl_622120-194037116").click(function(){

    //一般升高
    $("#ctrl_623120-18313424").css("top","30.68%");//百分比
    $("#ctrl_623120-18731143").css("top","17.53%");//公共收入

    //收入增幅
    $("#ctrl_623120-175614457").css("top","31.58%");//百分比
    $("#ctrl_623120-18548734").css("top","20.53%");//收入增幅
    $("#ctrl_623120-18826887").css("top","36.32%");//箭头

    //税占比
    $("#ctrl_623120-175949120").css("top","31.05%");//百分比
    $("#ctrl_623120-18731345").css("top","21.05%");//税占比



    $("#ctrl_622120-194039324").css("top","32%");
    $("#ctrl_622120-194111917").css("top","32%");
    $("#ctrl_622120-194037116").css("top","29%");
    $("#ctrl_625120-16501815").css("display","none");
    $("#ctrl_625120-16501359").css("display","block");
    $("#ctrl_622120-19457942").css("display","none");
    //全省
    $("#ctrl_625120-162817983").find("iframe")[0].contentWindow.changeData("一般公共预算收入");
});

//税占比
$("#ctrl_622120-194111917").click(function(){
    //税占比升高
    $("#ctrl_623120-18731345").css("top","18.05%");//标题
    $("#ctrl_623120-175949120").css("top","28.05%");//百分比

    //收入增幅
    $("#ctrl_623120-175614457").css("top","31.58%");//百分比
    $("#ctrl_623120-18548734").css("top","20.53%");//标题
    $("#ctrl_623120-18826887").css("top","36.32%");//箭头
    //一般
    $("#ctrl_623120-18731143").css("top","20.53%");//标题
    $("#ctrl_623120-18313424").css("top","33.68%");//百分比


    $("#ctrl_622120-194037116").css("top","32%");
    $("#ctrl_622120-194039324").css("top","32%");
    $("#ctrl_622120-194111917").css("top","29%");
    $("#ctrl_625120-16501815").css("display","none");
    $("#ctrl_625120-16501359").css("display","none");
    $("#ctrl_622120-19457942").css("display","block");


    $("#ctrl_625120-162817983").find("iframe")[0].contentWindow.changeData("税占比");
});
